llm/kimi_k2_7_code/b200/bench/bench_random_high.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31010, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='moonshotai/Kimi-K2.7-Code', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot/llm/kimi_k2_7_code/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31010/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31010, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='moonshotai/Kimi-K2.7-Code', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot/llm/kimi_k2_7_code/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 37205
#Output tokens: 360
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 80        
Successful requests:                     80        
Benchmark duration (s):                  20.88     
Total input tokens:                      37205     
Total input text tokens:                 37205     
Total generated tokens:                  360       
Total generated tokens (retokenized):    360       
Request throughput (req/s):              3.83      
Input token throughput (tok/s):          1781.95   
Output token throughput (tok/s):         17.24     
Peak output token throughput (tok/s):    68.00     
Peak concurrent requests:                80        
Total token throughput (tok/s):          1799.19   
Concurrency:                             55.07     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   14371.82  
Median E2E Latency (ms):                 14902.67  
P90 E2E Latency (ms):                    20867.02  
P95 E2E Latency (ms):                    20869.19  
P99 E2E Latency (ms):                    20871.81  
---------------Time to First Token----------------
Mean TTFT (ms):                          5934.02   
Median TTFT (ms):                        5469.52   
P90 TTFT (ms):                           7747.43   
P95 TTFT (ms):                           7748.57   
P99 TTFT (ms):                           7748.95   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2671.59   
Median TPOT (ms):                        2409.19   
P90 TPOT (ms):                           4483.90   
P95 TPOT (ms):                           4484.06   
P99 TPOT (ms):                           4484.13   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           2410.80   
Median ITL (ms):                         1974.30   
P90 ITL (ms):                            4484.02   
P95 ITL (ms):                            4484.06   
P99 ITL (ms):                            4484.12   
Max ITL (ms):                            6030.92   
==================================================